import re
from regexp import calculate


def findall(regexp):
    text = """
    a123b45с6d 
    """
    return re.findall(regexp, text)

result = calculate({'a': 1, 'b': 2, 'c': 3}, findall)
correct = {"a": -98, "b": 196, "c": -686}

if result == correct:
    print ("Correct")

else:
    print ("Incorrect: %s != %s" % (result, correct))

"""
Имя переменной слева.
Знак перед = (если есть).
Имя переменной справа (если есть).
    Число (если есть) со знаком (если есть).
\w(?=(=))(?=(-))|(\w(?=(-)))
\w(?=(-=)|(=)|(-=)|(\+=))(?=(-))
\w(?=(-=)|(=)|(-=)|(\+=))(?:[a-zA-Z]?)(?:(\-)?|(\+)?)(?:[a-zA-Z]?)
(?:([a-zA-Z]))(?:(-=|=|-=|\+=))(?:([a-zA-Z]{0,1}))(?:(\+{0,1}|-{0,1}[0-9]{0,1}))
(?:([a-zA-Z]))(?:(-=|=|-=|\+=))(?:([a-zA-Z]{0,1}))(?:(\-?\+?\d
(?:([a-zA-Z]))(?:(\-?\+?))(=)(?:([a-zA-Z]{0,1}))(?:(\-?\+?\d*))
(?:(a|b|c))(?:(\-?\+?))=(?:(a|b|c{0,1}))(?:(\-?\+?\d*))
"""
